---
kind: type
id: T:Autodesk.Revit.DB.EdgeArrayIterator
source: html/50ca2601-9cb4-d717-ac79-5796f85e1e76.htm
---
# Autodesk.Revit.DB.EdgeArrayIterator

An iterator to an edge array.

## Syntax (C#)
```csharp
public abstract class EdgeArrayIterator : APIObject,
	IEnumerator
```